---
kind: property
id: P:Autodesk.Revit.DB.Visual.AdvancedTransparent.SurfaceAnisotropy
source: html/0b9c02f6-687b-648d-dc75-65e899411c51.htm
---
# Autodesk.Revit.DB.Visual.AdvancedTransparent.SurfaceAnisotropy Property

The property labeled "Anisotropy" from the "AdvancedTransparent" schema.

## Syntax (C#)
```csharp
public static string SurfaceAnisotropy { get; }
```

## Remarks
This property is of type "AssetPropertyDouble".
 This property allows a connected asset.